uhnp/src/Reports/НастройкаОбработкиШаблоновДокументов/НастройкаОбработкиШаблоновДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>НастройкаОбработкиШаблоновДокументов</name>
  <attributes>
    <name>ВерсияРегламента</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>СдвигЗаголовков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпактныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксКлючевыхАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Reports/НастройкаОбработкиШаблоновДокументов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция УтвердитьБланкиИПравила() Экспорт
	
	// Получаем схему из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// Настройки схемы компоновки данных
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки.Структура.Получить(0).Использование = Ложь;
	Настройки.Структура.Получить(1).Использование = Ложь;
	Настройки.Структура.Получить(2).Использование = Ложь;
	Настройки.Структура.Получить(3).Использование = Ложь;
	Настройки.Структура.Получить(4).Использование = Истина;
	
	// Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	// Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , 
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	// Получим результат в таблицу
	ТаблицаДанных = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СпрОбъект = СтрокаТаблицы.ЗначениеДляУтверждения.ПолучитьОбъект();
		СпрОбъект.ОбменДанными.Загрузка = истина;
		Если ТипЗнч(СпрОбъект) = Тип("СправочникОбъект.БланкиОтчетов") Тогда
			Если СпрОбъект.Утвержден Тогда
				Продолжить;
			КонецЕсли;
			СпрОбъект.Утвержден = Истина;
		Иначе
			Если СпрОбъект.Утверждено Тогда
				Продолжить;
			КонецЕсли;
			СпрОбъект.Утверждено = Истина;
		КонецЕсли;
		
		Попытка
			СпрОбъект.Записать();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = 'Не удалось записать ""%1"", по причине: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
				СпрОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// Получаем схему из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// Настройки схемы компоновки данных
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпактныйРежим = Настройки.ПараметрыДанных.Элементы.Найти("КомпактныйРежим").Значение;
	Если КомпактныйРежим Тогда
		ТаблицаВывода = Настройки.Структура.Получить(1);
		ТаблицаВывода.Использование = Ложь;
		ТаблицаВывода = Настройки.Структура.Получить(3);
		ТаблицаВывода.Использование = Истина;
		ТаблицаВывода = Настройки.Структура.Получить(2);
	Иначе
		ТаблицаВывода = Настройки.Структура.Получить(2);
		ТаблицаВывода.Использование = Ложь;
		ТаблицаВывода = Настройки.Структура.Получить(1);
	КонецЕсли;
	ДанныеАналитик = Настройки.Структура.Получить(0);
	
	ДанныеАналитик.Использование = Истина;
	ТаблицаВывода.Использование = Ложь;
	
	// Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	// Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки, , 
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	// Получим результат в таблицу
	ТаблицаДанных = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если ТаблицаДанных.Количество() > 0 Тогда
		СтрокаТаблицы = ТаблицаДанных.Получить(0);
		МаксКлючевыхАналитик = ?(ЗначениеЗаполнено(СтрокаТаблицы.МаксКлючевыхАналитик), СтрокаТаблицы.МаксКлючевыхАналитик, 0);
		РазделениеПоПроектам = СтрокаТаблицы.РазделениеПоПроектам = Истина;
	Иначе
		МаксКлючевыхАналитик = 0;
		РазделениеПоПроектам = Ложь;
	КонецЕсли;
	
	// Выполняем необходимые настройки
	ДанныеАналитик.Использование = Ложь;
	ТаблицаВывода.Использование = Истина;
	
	ЭлементыВложеннойГруппировки = ТаблицаВывода.Строки[0].ПоляГруппировки.Элементы;
	ИерархияВидовОтчетов = Настройки.ПараметрыДанных.Элементы.Найти("ИерархияВидовОтчетов").Значение;
	ЭлементыВложеннойГруппировки.Получить(0).ТипГруппировки = ?(ИерархияВидовОтчетов, ТипГруппировкиКомпоновкиДанных.Иерархия, ТипГруппировкиКомпоновкиДанных.Элементы);
	
	СдвигЗаголовков = ПараметрыСеанса.ЧислоДопАналитик+3;
	Если НЕ КомпактныйРежим Тогда
		ЭлементыВложеннойГруппировки = ТаблицаВывода.Строки.Получить(0).Структура[0].ПоляГруппировки.Элементы;
	КонецЕсли;
	Если НЕ РазделениеПоПроектам Тогда
		ЭлементыВложеннойГруппировки.Получить(1).Использование = Ложь;
		СдвигЗаголовков = СдвигЗаголовков - 1;
	КонецЕсли;
	Для Счетчик = МаксКлючевыхАналитик+1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		ЭлементыВложеннойГруппировки.Получить(Счетчик + 1).Использование = Ложь;
		СдвигЗаголовков = СдвигЗаголовков - 1;
	КонецЦикла;
	
	// Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	// Очищаем поле табличного документа
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// Доработаем таблицу вручную
	Если КомпактныйРежим Тогда
		ОбластьДорботки = ДокументРезультат.Область(1, 1, 1, 1);
		ОбластьДорботки.Текст = НСтр("ru = 'Шаблон документа / Организация'");
	Иначе
		ДоработатьТабличныйДокументПослеВывода(ДокументРезультат, ДанныеРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДоработатьТабличныйДокументПослеВывода(ДокументРезультат, ДанныеРасшифровки)
	
	// Заголовок
	Если СдвигЗаголовков = 2 Тогда
		ОбластьДорботки = ДокументРезультат.Область(1, 1, 2, СдвигЗаголовков);
		ОбластьДорботки.Объединить();
	Иначе
		ОбластьДорботки = ДокументРезультат.Область(1, 1, 1, СдвигЗаголовков);
	КонецЕсли;
	ОбластьДорботки.Текст = НСтр("ru = 'Шаблон документа / Организация'");
	
	// Область группировки шаблонов документов
	ЦветФона = Новый Цвет(251, 249, 236);
	ШиринаТаблицы = ДокументРезультат.ШиринаТаблицы;
	Для Сч = 2 По ДокументРезультат.ВысотаТаблицы Цикл
		
		ТекОбласть = ДокументРезультат.Область(Сч, 1, Сч, 1);
		ТекРасшифровка = ТекОбласть.Расшифровка;
		
		Если ТекРасшифровка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляРасшифровки = ДанныеРасшифровки.Элементы[ТекРасшифровка].ПолучитьПоля();
		Если ПоляРасшифровки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеРасшифровки = ПоляРасшифровки.Получить(0);
		
		Если ЗначениеРасшифровки.Поле = "ШаблонДокумента" Тогда
			
			Если ЗначениеЗаполнено(ТекОбласть.Текст) Тогда
				ОбластьДоработки = ДокументРезультат.Область(Сч, 1, Сч, ШиринаТаблицы);
				ОбластьДоработки.Объединить();
			Иначе
				ОбластьДоработки = ДокументРезультат.Область(Сч, СдвигЗаголовков, Сч+4, СдвигЗаголовков);
				ОбластьДоработки.ЦветФона = ЦветФона;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла

КонецПроцедуры

#КонецОбласти

#КонецЕсли
